Tekla Open API Reference for Tekla Structures 2025
BaseRebarGroup.Spacings Property
 The spacing value(s). If the type of the spacing is SPACING_TYPE_EXACT_NUMBER Spacings has only one value that defines the number of the reinforcing bars.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Spacings { get; set; }
Public Property Spacings As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
BaseRebarGroup Class
Tekla.Structures.Model Namespace